<?php 

echo "<h2>Рекомендуемые к прочтению</h2>";


$books = array("Рэй Бредбери" => "'451° по Фаренгейту', 'Вино из одуванчиков'",
               "Грегори Дэвид Робертс" => "'Шантарам'",
               "Джордж Оруэлл" => "'1984'",
               "Михаил Афанасьевич Булгаков" =>  "'Мастер и Маргарита'",
               "Эрих Мария Ремарк" => "'Три товарища'",
               "Оскар Уайльд" => "'Портрет Дориана Грея'",
               "Даниел Киз" => "'Цветы для Элджернона'",
               "Джером Д. Сэлинджер" => "'Над пропастью во ржи'",
               "Антуан де Сент-Экзюпери" => "'Маленький принц'",
               "Лев Толстой" => "'Анна Каренина'",
               "Габриэль Гарсиа Маркес" => "'Сто лет одиночества'",
               "Грегори Дэвид Робертс" => "'Тень горы'",
               "Айн Рэнд" => "'Атлант расправил плечи'" 
            );
echo "<ol>";
foreach ($books as $key => $value) {
	echo "<li><b>Автор:</b> $key<br>  <b>Книга:</b> $value<br></li>";
}
echo "</ol>";

/*$listBooks = count($books);

echo "<ol>";
for($i = 0; $i < $listBooks; $i++){
	echo "<li>$books[$i]</li>";
}
echo "</ol>";*/

?>