<?php 

echo "<h1>Список хороших книг</h1>";


$books = array("451° по Фаренгейту", 
	            "Шантарам",
	            "1984",
               "Мастер и Маргарита",
               "Три товарища",
               "Портрет Дориана Грея",
               "Вино из одуванчиков",
               "Цветы для Элджернона",
               "Над пропастью во ржи",
               "Маленький принц",
               "Анна Каренина",
               "Сто лет одиночества",
	            "Тень горы",
	            "Атлант расправил плечи" );

$listBooks = count($books);

echo "<ol>";
for($i = 0; $i < $listBooks; $i++){
	echo "<li>$books[$i]</li>";
}
echo "</ol>";

?>